Repository: StanfordSpezi/SpeziDevices
Catalog: Sources/SpeziDevicesUI/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, sv

source: Access was restricted by the user.
de: Der Zugriff wurde vom Benutzer eingeschränkt.
es: El acceso fue restringido por el usuario.
sv: Åtkomsten begränsades av användaren.

source: Activation Failed
de: Aktivierung fehlgeschlagen
es: La activación falló
sv: Aktiveringen misslyckades

source: Bluetooth must be powered on for this operation.
de: Für diesen Vorgang muss Bluetooth eingeschaltet sein.
es: Para realizar esta operación, Bluetooth debe estar encendido.
sv: Bluetooth måste vara påslaget för att denna åtgärd ska fungera.

source: Busy
de: Beschäftigt
es: Ocupado
sv: Upptagen

source: Cancelled
de: Abgebrochen
es: Cancelado
sv: Avbruten

source: Connection Failed
de: Verbindung fehlgeschlagen
es: La conexión falló
sv: Anslutningen misslyckades

source: Control Point Error
de: Fehler am Steuerpunkt
es: Error en el punto de control
sv: Fel vid kontrollpunkt

source: Control point request was sent to %1$@ on %2$@ but notifications weren't enabled for that characteristic.
de: Eine Steuerpunktanfrage wurde an %@ auf %@ gesendet, aber Benachrichtigungen waren für diese Eigenschaft nicht aktiviert.
es: Se envió una solicitud de punto de control a %@ en %@, pero las notificaciones no estaban habilitadas para esa característica.
sv: En kontrollpunktsförfrågan skickades till %@ på %@ men aviseringar var inte aktiverade för den egenskapen.

source: Control point request was sent to %1$@ on %2$@ while waiting for a response to a previous request.
de: Eine Steuerpunktanfrage wurde an %@ auf %@ gesendet, während noch auf eine Antwort auf eine vorherige Anfrage gewartet wurde.
es: Se envió una solicitud de punto de control a %@ en %@ mientras se esperaba la respuesta de una solicitud anterior.
sv: En kontrollpunktsförfrågan skickades till %@ på %@ medan svar på en tidigare begäran fortfarande väntades.

source: Could not decode byte representation into provided format.
de: Die Byte-Daten konnten nicht in das angegebene Format dekodiert werden.
es: No se pudo decodificar los datos en el formato proporcionado.
sv: Det gick inte att avkoda data i det angivna formatet.

source: Decoding Error
de: Dekodierungsfehler
es: Error de decodificación
sv: Avkodningsfel

source: Device disconnected
de: Gerät getrennt
es: El dispositivo se desconectó
sv: Enheten kopplades från

source: Device disconnected due to unknown reasons.
de: Das Gerät wurde aus unbekannten Gründen getrennt.
es: El dispositivo se desconectó por razones desconocidas.
sv: Enheten kopplades från av okänd anledning.

source: Discovery session timed out.
de: Die Erkennungssitzung ist abgelaufen.
es: La sesión de descubrimiento superó el tiempo límite.
sv: Sökningen tog för lång tid.

source: Discovery Timeout
de: Zeitüberschreitung bei der Erkennung
es: Tiempo de espera agotado
sv: Tidsgräns överskriden

source: Extension Not Found
de: Erweiterung nicht gefunden
es: Extensión no encontrada
sv: Tillägget hittades inte

source: Invalid Request
de: Ungültige Anfrage
es: Solicitud inválida
sv: Ogiltig begäran

source: Invalid State
de: Ungültiger Zustand
es: Estado inválido
sv: Ogiltigt tillstånd

source: Invalidate was called before the operation completed normally.
de: Ungültig machen wurde aufgerufen, bevor der Vorgang abgeschlossen war.
es: Se llamó a invalidar antes de que la operación finalizara correctamente.
sv: Ogiltigförklaring anropades innan åtgärden var slutförd.

source: Invalidated
de: Ungültig gemacht
es: Invalidado
sv: Ogiltigförklarad

source: Not Present
de: Nicht vorhanden
es: No disponible
sv: Inte tillgänglig

source: Operation completed successfully.
de: Der Vorgang wurde erfolgreich abgeschlossen.
es: La operación se completó correctamente.
sv: Åtgärden slutfördes framgångsrikt.

source: Received an invalid request.
de: Es wurde eine ungültige Anfrage empfangen.
es: Se recibió una solicitud inválida.
sv: En ogiltig begäran togs emot.

source: Restricted
de: Eingeschränkt
es: Restringido
sv: Begränsad

source: Success
de: Erfolgreich
es: Correcto
sv: Lyckades

source: The picker is already active.
de: Die Auswahl ist bereits aktiv.
es: El selector ya está activo.
sv: Väljaren är redan igång.

source: The picker is restricted due to the application being in the background.
de: Die Auswahl ist eingeschränkt, da die Anwendung im Hintergrund läuft.
es: El selector está restringido porque la aplicación se ejecuta en segundo plano.
sv: Väljaren är begränsad eftersom appen körs i bakgrunden.

# The requested characteristic %@ on %@ was not present on the device.
source: The requested characteristic %1$@ on %2$@ was not present on the device.
de: Die angeforderte Eigenschaft %@ auf %@ war auf dem Gerät nicht verfügbar.
es: La característica solicitada %@ en %@ no estaba disponible en el dispositivo.
sv: Den begärda egenskapen %@ på %@ fanns inte på enheten.

source: The user cancelled the discovery.
de: Der Benutzer hat die Erkennung abgebrochen.
es: El usuario canceló el descubrimiento.
sv: Användaren avbröt sökningen.

source: Unable to activate discovery session.
de: Die Erkennungssitzung konnte nicht gestartet werden.
es: No se pudo activar la sesión de descubrimiento.
sv: Det gick inte att starta sökningen.

source: Unable to establish connection with the accessory.
de: Verbindung mit dem Zubehör konnte nicht hergestellt werden.
es: No se pudo establecer la conexión con el accesorio.
sv: Det gick inte att ansluta till tillbehöret.

source: Unable to locate the App Extension.
de: Die App-Erweiterung konnte nicht gefunden werden.
es: No se pudo encontrar la extensión de la aplicación.
sv: Det gick inte att hitta appens tillägg.

source: Unknown
de: Unbekannt
es: Desconocido
sv: Okänt

source: Unknown error occurred.
de: Ein unbekannter Fehler ist aufgetreten.
es: Ocurrió un error desconocido.
sv: Ett okänt fel inträffade.
